#!/usr/bin/env bash

###################################################################################
# Linux CentOS 环境初始化脚本（设置环境配置、安装基本的命令工具）
# Author: Zhang Peng
###################################################################################

cat << EOF
***********************************************************************************
* The initialization of linux environment is begin.
***********************************************************************************
EOF

filepath=$(cd "$(dirname "$0")"; pwd)

# 替换 yum 镜像（使用国内镜像，加速下载）
${filepath}/yum/change-yum-repo.sh

# 设置环境配置，不了解具体修改内容的情况下，请勿执行
${filepath}/config-env.sh

# 安装命令行工具
${filepath}/install-tools.sh

cat << EOF
***********************************************************************************
* The initialization of linux environment is over.
***********************************************************************************
EOF
